#######################匯入模組#######################
# 匯入 tkinter 模組（用於建立圖形介面）
from tkinter import *  # 匯入 tkinter 所有名稱，方便使用按鈕、標籤等元件
import sys
import os

#######################設定工作目錄#######################
os.chdir(sys.path[0])  # 將工作目錄切換到當前腳本所在的目錄

#######################定義函數########################


#######################建立視窗########################
# 建立視窗物件
windows = Tk()  # 建立主視窗物件
Canvas = Canvas(windows, width=600, height=600, bg="white")
Canvas.pack()  # 將 Canvas 元件加入視窗並顯示
#######################創建畫布########################


#######################設定視窗圖片########################
windows.iconbitmap("")  # 設定視窗的圖示為 "icon.ico" 文件


#######################載入圖片########################
img = PhotoImage(file="")

#######################顯示圖片########################
my_img = Canvas.create_image(
    300, 300, image=img
)  # 在 Canvas 上顯示圖片，位置為 (300, 300)
#######################運行應用程式########################
# 運行應用程式
windows.mainloop()  # 進入主迴圈，保持視窗運作
